Рабочая.Задачи2/src/InformationRegisters/ЦБР_ЗанятостьПоДням/ЦБР_ЗанятостьПоДням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_ЗанятостьПоДням</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПостановщика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_ЗанятостьПоДням/ManagerModule.bsl
// Процедура - Сделать запись в регистр
//
// Параметры:
//  ДанныеЗаполнения - Структура  -
//	 * Период - Дата
//	 * Задание - ДокументСсылка.ЦБР_Задание
//	 * КоличествоЧасов - Число 
//	 * Постановщик - СправочникСсылка.Пользователи
//	 * ПодразделениеПостановщика - СправочникСсылка.СтруктураПредприятия
//	 * Исполнитель - СправочникСсылка.Пользователи
//	 * ПодразделениеИсполнителя - СправочникСсылка.СтруктураПредприятия
//
Процедура СделатьЗаписьВРегистр(ДанныеЗаполнения) Экспорт
	МенеджерЗаписи  = РегистрыСведений.ЦБР_ЗанятостьПоДням.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры 

Функция ПолучитьСтруктуруДляЗаписи() Экспорт 
	
	ДанныеЗаполнения = Новый Структура("Дата, Задание, КоличествоЧасов, Постановщик, ПодразделениеПостановщика, Исполнитель, ПодразделениеИсполнителя");	
	Возврат ДанныеЗаполнения;
	
КонецФункции
